[
  {
    "id": "274a58c3-1f2e-4c24-a8d8-8dd2e41301b1",
    "company": "InnoGames GmbH",
    "company_logo": "https://i.stack.imgur.com/2okwJ.png",
    "type": "Full time",
    "title": "Frontend Developer (Haxe) - Video Game: Forge of Empires",
    "location": "Hamburg",
    "description": "Our agile and cross-functional **Forge of Empires** team is searching for a **Frontend Developer**:As a Frontend Developer, you will join a feature team of the Forge of Empires project to support growth, technical stability and longevity of our game.Are you a talented Game Developer and passionate about online games? Live your passion for online games/Game Development and collaborate with like-minded people to provide the best user experience for our players!**Your mission:**- Contribute to the continuous development and improvement of one of our keystone games- Develop new features and improve existing game features with a strong focus on UI and UX- Participate in the whole feature development lifecycle with a commitment to high-quality results- Collaborate closely with Mobile- & Backend Developers, Game Designers, and Artists to implement new game features for our browser clients**Your skillset:**- Working experience in Frontend/Game Development with Haxe. ActionScript 3 or JavaScript experience is a bonus.- A right eye for details and a passion for implementing UI and UX- Well-versed in design patterns and software architecture- Experience with writing browser automation tests- Solution-oriented and efficient style of work- Team player and a good communicator with fluent English language skills*Favorable*- Passion for online games (strategy/F2P) and knowledge of relevant game mechanics- Professional experience in the gaming industry, ideally working on comparable browser games- Theoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies- Know your way around popular scripting languages (Python / Bash / Groovy)- A proactive and motivated individual with a willingness to learn**Your power-ups:**- Get competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more- De-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more- Participate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting- Make the most of our excellent training and development opportunities- Feel comfortable in an atmosphere to empower creative thinking and strong results- Work in an agile multicultural team – enabling you and your team to form and actively optimize work processes- Our company language is English, and we support all our employees and their partners with optional German lessons- Receive exceptional support with your relocation to Hamburg- Shape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer**Our story:**InnoGames is Germany's leading developer and publisher of mobile and online games.The company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.Born as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.To further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.Excited to start your journey with InnoGames and join our dynamic team as a **Frontend Developer**?We look forward to receiving your application as well as your salary expectations and earliest possible starting date through our [online application form](https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub). **Maximilian Kaeding** would be happy to answer any questions you may have.**Apply and #stayhome!**Due to the **coronavirus** outbreak, we switched our operations company-wide to home office and turned our hiring process into a **fully virtual one**.When hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.Stay home and safe!",
    "url": "https://www.innogames.com",
    "how_to_apply": "https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub",
    "created_at": "Thu Feb 18 07:39:14 UTC 2021"
  },

  {
    "id": "274a58c3-1ef2e-4c24-a8d8-8dd2e41301b1",
    "company": "Evernest GmbH",
    "company_logo": "https://images.ctfassets.net/if6f7uzjzqut/5u9COGYgSdkFtJ6MHTBiCb/6e9b2869327ef58a26cd1e940a4d7a6f/c795f896-2dd5-4e14-bffe-de9c88f3b05a.jpeg",
    "type": "Full time",
    "title": "Senior Frontend Engineer*",
    "location": "Hamburg",
    "description": "Evernest is a Proptech startup from Hamburg backed by top investors. We are redefining how homes are bought and sold in metropolitan areas. To do so, we combine start-up culture with years of extensive industry experience. We are convinced that agents, sellers and buyers deserve a better service and more support. That is why we are bringing together the world’s top minds in technology, data and real estate. We offer agents and their clients a platform for a previously unseen and seamless real estate experience. **Responsibilities**- Building a top-notch and intuitive front-end for our platform that empowers real estate agents, buyers and sellers- Building a mobile application that empowers real estate agents- Evaluating visual designs from a technical perspective- Being part of our agile, smart and open-minded team- Getting better every day by taking on challenging tasks **Qualifications**- Solid understanding of and experience with React.js (> 3 years)- Profound knowledge of TypeScript/ESnext and its ecosystem (> 3 years), ideally also of other programming languages- Experience with CSS-in-JS technologies (preferred Emotion.js or Styled Components)- Understanding the importance of A11y and how to implement it in custom components- Mobile first layouts and responsive websites- Solid understanding of and experience with React Native- Semantic HTML and the value of SEO- DevOps mindset: operating and maintaining our software is a collective responsibility- Passion to share knowledge and strive to learn from others- Constant drive for improving processes and thinking in long-term wins- Good communication skills - Fluency in English, written and verbal; German is a plus**Current Tech Stack**- Docker, GCloud, Kubernetes- PostgreSQL- Python, Django, Django REST Framework- ES6, React, Typescript, Node.js- Contentful CMS- Storybook- Emotion.js- Next.js- GraphQL **Benefits**- Permanent position with above average compensation package- 27 days of paid vacation- Productivity equipment (laptop, mobile phone)- Homeoffice- Challenging position in a fast-paced environment Your mindset is what matters to us - your age, your sex or your origin makes no difference at Evernest. It’s important that you fit into our team.Sounds good? Just submit your resume!talents@evernest.com",
    "url": "https://www.innogames.com",
    "how_to_apply": "Sounds good? Just submit your resume!talents@evernest.com",
    "created_at": "Fri Feb 19 15:22:43 UTC 2021"
  },

  {
    "company": "Randstad Groep Nederland B.V.",

    "company_logo": null,
    "company_url": "https://www.werkenbijrandstad.nl/",
    "created_at": "Fri Apr 23 09:02:57 UTC 2021",
    "description": "Wil jij samen met onze ontwikkelaars kwalitatieve oplossingen realiseren door jouw ervaring als DevOps engineer in te zetten voor de platform services voor onze business applicaties? In een omgeving waarin experimenteren, vrijheid en jouw ontwikkeling centraal staat? Dan is het zeker de moeite waard om verder te lezen!\r\n\r\n**OVER RANDSTAD GROEP NEDERLAND IT**\r\n\r\nDe IT-afdeling van Randstad Groep Nederland is verantwoordelijk voor de volledige ICT-dienstverlening, waaronder het ontwikkelen van applicaties. De developers van RGN IT ontwikkelen IT-oplossingen die mens en werk dichter bij elkaar brengen. Als DevOps engineer ondersteun je hen bij de ontwikkeling van deze applicaties.\r\n\r\n**WAT GA JE DOEN?**\r\n\r\nAls DevOps Engineer bij Randstad Groep IT zul je verantwoordelijk zijn voor het optimaal inrichten en opzetten van de platform services binnen RGN-IT. Deze platform services bieden ondersteuning aan de ontwikkelteams op het gebied van:\r\n- Monitoring\r\n- CI/CD\r\n- Event bus\r\n- Integratie\r\n\r\nIn een gemiddelde werkweek hou jij je bezig met het onderhouden van de verschillende platform services, het ondersteunen van de ontwikkelteams, het verbeteren van de platform services, en het implementeren van de platform services binnen RGN-IT. Als je energie krijgt van een cloud omgeving, innovatie en uitdaging, dan zit je goed!\r\n\r\n**MET WIE WERK JE SAMEN?**\r\n\r\nBinnen RGN IT zal je werken binnen het Cloud Infra Solutions domein, waar binnen teams met verschillende expertisegebieden werken aan een beter en veiliger Randstad. Zo zijn naast het Cloud Infrastructure Services (CIS)  ook het Security Operations Center (SOC) & Security Test Team (STT) onderdeel van dit domein. Het doel van het domein is om zowel qua infrastructuur als security Randstad Groep Nederland verder te brengen. \r\n\r\nDaarnaast werk je heel veel samen met meerdere ontwikkel/DevOps teams.In totaal hebben wij zo’n 26 DevOps teams in onze IT organisatie, met in totaal meer dan 250 collega’s. We werken veel samen in cross-functional product teams volgens een agile werkwijze, maar blijven ook graag bij elkaar aangesloten, door bijvoorbeeld onze chapters.\r\n\r\nWist je trouwens dat ruim 30% van onze IT-professionals vrouw is? Best uitzonderlijk voor een IT-organisatie. En hartstikke mooi. Want we weten: hoe diverser de teams, hoe beter de resultaten.\r\n\r\n**WIE BEN JE?**\r\n\r\nJij zou goed binnen Randstad Groep IT passen wanneer je de interesse hebt om veel te leren en uitdaging ziet in snelle ontwikkelingen. Jij vindt het leuk om verder te kijken dan jouw eigen werkveld en helpt jouw collega’s ook graag verder waar je dat kan. Verder vinden we het belangrijk dat jij:\r\n- Werkervaring hebt als developer\r\n- Ervaring hebt met scripting-talen, provisioning tool (zoals puppet, jenkins), test tools (zoals SonarQube)\r\n- Kennis hebt van ELK, Enterprise Bus technologie, source control tools, CI/CD tools\r\n- En brede interesse (of nog beter ervaring) hebt in Amazon Web Services, zodat je in meerdere disciplines aan de slag kunt \r\n\r\nWe zoeken iemand met de volgende eigenschappen:\r\n\r\n- HBO/WO werk- en denkniveau \r\n- ca. 3 jaar ervaring in het werkgebied\r\n- Ambitie om je verder te ontwikkelen\r\n- Goede kennis van de Engelse taal, en bij voorkeur de Nederlandse taal\r\n- Een analytisch en pragmatisch houding\r\n- Klant- en oplossingsgericht\r\n- In staat om risico's en passende niveaus van urgentie effectief te beoordelen en te communiceren aan zowel management als technisch personeel.\r\n- Je bent een teamplayer\r\n\r\n**WAT BIEDEN WIJ?**\r\n\r\n- Een divers applicatielandschap waar alle aspecten van het vakgebied aan bod komen, zodat je je volledig kan ontplooien als encryptie specialist.\r\n- Een bruto maandsalaris tussen € 2.750 en € 4.000  afhankelijk van werkervaring\r\n- De mogelijkheid om vanuit huis te werken.\r\n- Trainingen, zowel gericht op soft skills als vakinhoudelijk.\r\n- Een ruim maandelijks benefit budget waarmee je zelf kunt kiezen tussen vrije tijd of geld, of voor inzet van je budget voor oa een fiets, tablet, sportabonnement of opleiding.\r\n- 25 vakantiedagen en 8,5% vakantietoeslag.\r\n- Een interessante bonusregeling met daarnaast mogelijkheid om 2x per jaar een outperformance bonus te behalen.\r\n\r\n**WAAROM RGN IT?**\r\n\r\nAls IT-professional bij een van de grootste uitzendorganisaties ter wereld help je mee de samenleving draaiende te houden. Wij ondersteunen de HR-dienstverlening van Randstad Groep Nederland met software die we continu verbeteren. Wij geloven in de kracht van technologie, maar wél gecombineerd met persoonlijke aandacht. En dat geldt evengoed voor onze eigen medewerkers: wij zien jouw vooruitstrevende ideeën, maar vooral jou. Jouw werkplezier staat voorop. \r\n\r\nBinnen de IT-organisatie van Randstad Groep Nederland bouwen we aan hechte teams, waarin je alle ruimte krijgt om je ideeën waar te maken en om jezelf te ontwikkelen. Wij bieden je volop mogelijkheden om te groeien. Zo bieden wij niet alleen een baan, maar een carrière. De enorme diversiteit aan functies binnen heel Randstad Groep Nederland biedt interessante doorgroeimogelijkheden. Wist je dat 80% van ons hoger management binnen onze eigen organisatie is opgeklommen? Kom erbij en groei!\r\n\r\nWord jij onze nieuwe DevOps Engineer?\r\n\r\nBen jij de persoon die continu de focus zal leggen op het verbeteren van onze dienstverlening voor de medewerkers en klanten van Randstad Groep Nederland? Dan kijken we uit naar je sollicitatie!\r\n\r\n\r\n--",
    "how_to_apply": "Ga direct naar [**het sollicitatieformulier**](https://www.werkenbijrandstad.nl/nl/nl/apply?jobSeqNo=RANEUKR18496EXTERNALNLNL&utm_source=github&utm_medium=paid&utm_campaign=cr-it)!",
    "id": "21a5ad81-2237-4544-b5d7-258b59d84cd5",
    "location": "Diemen/Amsterdam",
    "timestamp": "Fri Apr 23 2021 18:50:04 GMT+0100 (West Africa Standard Time)",
    "title": "DevOps Engineer",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/21a5ad81-2237-4544-b5d7-258b59d84cd5"
  },
  {
    "company": "SweetRush",

    "company_logo": null,
    "company_url": "https://www.sweetrush.com/",
    "created_at": "Wed May 19 00:49:17 UTC 2021",
    "description": "**SweetRush has an exciting opportunity for an experienced creative front-end developer (full stack is also acceptable) with an eye for graphic and UX design!**\r\n\r\n**ABOUT THE ROLE:** \r\n\r\nThis is an important role on the Engineering and Development department’s Course Development team, and you will be reporting directly to the Course Development team lead.\r\n\r\nHistorically, the developers most successful in this role contribute to multiple projects at the same time; show a willingness to improve existing techniques, frameworks, and templates; and come up with innovations of their own. You will succeed if you truly enjoy active collaboration with your colleagues and don’t mind stepping in when your help is required.\r\n\r\nThis is a remote position and a great opportunity to work from home. Candidates from all geographic locations are welcome to apply; however, our development team is mostly based in North and Latin America, and you should be willing to work during our business hours.\r\n\r\n**REQUIRED SKILLS:** \r\n\r\n**Front end**\r\n\r\n- 7+ years as a front-end or full-stack developer in a creative environment\r\n- Expert-level JavaScript skills—Vanilla JS expertise is as important as the knowledge of frameworks and libraries \r\n- High level of competency in HTML5 and CSS3 \r\n- Familiarity with one or more frameworks, preferably **React and Node.js**\r\n- While React is the most commonly used framework at the moment, your proven ability to quickly harness unfamiliar technology is more important than an intimate knowledge of any of the given frameworks.\r\n- **Most importantly - you can look at just about any cool effect, interaction, animation, parallax, website on the web, and say - Even if I can’t do this now, I want to try!**\r\n- Understanding of responsive design and mobile-first principles\r\n\r\n**Soft skills and generic productivity tools**\r\n\r\n- Ability to clearly communicate in English\r\n- English verbal communication skills are an absolute must because the position requires frequent interaction with peers and clients.\r\n- Experience with version control systems such as Git or Subversion\r\n- Experience working in a team development environment or demonstrating a capacity to do so \r\n- Enjoy learning and experimenting, open to new ideas\r\n\r\n**YOU WILL IMPRESS EVERYONE IF YOU:**\r\n- Have built a learning simulation\r\n- Have experience with mobile app development and distribution\r\n- Have experience with graphic and UX design\r\n- Know anything about Adapt Framework\r\n\r\n**YOU MAY BE EXPECTED TO:**\r\n- Complete a test assignment\r\n- Be interviewed by a number of highly judgmental yet supremely talented future colleagues\r\n\r\n**THE ESSENCE OF THE JOB**\r\n\r\nOK, now that you’ve made it through all the obligatory language, you may be wondering what this position is really all about. Therefore, please read the rest of this job description carefully!\r\n\r\nIt all boils down to your ability to make a simple claim: **I can do it!**\r\n\r\nIf we show you an interactive website with intricate animations, a complicated menu system, and multiple interdependencies, you should state: **I can do it!**\r\n\r\nIf we need to harness a complex web-based gaming engine and use it for the first time to build a learning simulation, you should confidently assert: **I can do it!**\r\n\r\nIf we need to produce a large volume of digital training materials in a record short period of time, you should answer: **I can do it!**\r\n\r\nAnd if we need an adventurous engineer to lead the team in the creation of a system that is completely different from everything we have done before, we’re most definitely looking for the loud **I can do it!** \r\n\r\nAnd even more importantly, you must **want to do it**.\r\n\r\nSweetRush is a team of winners. These are not empty words. Just check out our impressive industry trophy shelf, which includes this recent success: https://www.sweetrush.com/sweetrush-wins-16-awards-brandon-hall-awards-2020.\r\n\r\nAs a winner, you will always want the ball. Want to do better. Want to be more creative and efficient. Join us, and let's see if we can win even more by working together!\r\n\r\nThis is a work-from-home opportunity! We are 100% virtual, and all communications occur over digital channels (Skype/Web Share/email), apart from infrequent on-site meetings. Occasional travel may be required. \r\n\r\n**Please note: We're all about remote work and have collaborators based all around the world; however, SweetRush is a US-based company, and English is our primary language. If you'd like to be considered for this opportunity, please submit your resume in English.**",
    "how_to_apply": "If this describes your interests and experience, please submit your current resume and salary requirements through the following link:\r\nhttps://www.sweetrush.com/join-us/",
    "id": "32bf67e5-4971-47ce-985c-44b6b3860cdb",
    "location": "Remote",
    "timestamp": "Sun May 30 2021 22:58:38 GMT+0800 (China Standard Time)",
    "title": "Senior Creative Front End Web Developer",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/32bf67e5-4971-47ce-985c-44b6b3860cdb"
  },
  {
    "company": "CreatorBooks",

    "company_logo": null,
    "company_url": "https://creatorbooks.com",
    "created_at": "Wed Apr 21 13:29:30 UTC 2021",
    "description": "Hi, my name is Paulina Masson, I am a serial entrepreneur and I enjoy building software companies. The previous company that I built became very successful and was acquired for 7 figures. My background is in software development, but I now focus solely on marketing and business growth.\r\n\r\nI am looking for a full stack software developer to build the initial version of the new software I conceptualized.\r\n\r\nCreatorBooks will be a business analytics software for Youtubers and Streamers.\r\n\r\nWe will work with many services content creators use, to pull revenue data via available APIs, such as Amazon Associates, Google Adsense, Twitch API, etc. We will also be reading data from hundreds of affiliate network websites via a browser plugin.\r\n\r\nIdeally, you have experience working at a startup or working on complex projects.\r\n\r\nYou will have a lot of creative power when it comes to architectural decisions, which may be more enjoyable for you, comparing to working at a large company.\r\n\r\nIf you love to take up new challenges and build something complex and interesting from scratch, let’s work together. I am looking for someone who is reliable and trustworthy.\r\n\r\nREQUIREMENTS:\r\n\r\nThis is a proper full stack position. You'll need knowledge of backend, frontend and enough devops to run and maintain the app:\r\n\r\nLaravel 8.x\r\n\r\nPHP 7.4\r\n\r\nPostgreSQL\r\n\r\nJavaScript (ES6)\r\n\r\nReact\r\n\r\nAWS (EC2, RDS, etc)\r\n\r\nI have already chosen this theme to develop the application: https://preview.keenthemes.com/metronic/demo1/index.html\r\n\r\nBENEFITS:\r\n\r\nNo corporate structure, small team - no overhead. Everything you need gets communicated fast and decided on quickly.\r\n\r\nThree weeks of paid vacation a year plus paid national holidays (based on your country).\r\n\r\nYou'll have plenty of opportunities to learn new skills and grow professionally.\r\n\r\nOpen, relaxed and friendly work environment.\r\n\r\nOpportunity to see first hand, how a startup grows from MVP to a 7 figure business, and learn from that experience.\r\n\r\nSalary Range: $4,500 - $5,500 USD a month, with yearly salary increases.",
    "how_to_apply": "Apply here: \r\nhttps://apply.workable.com/creatorbooks/j/63B1107CAB/",
    "id": "70cd5f54-5c16-4d0c-a9dc-1f985bab6de2",
    "location": "Remote",
    "timestamp": "Wed Apr 21 2021 19:56:38 GMT-0500 (Central Daylight Time)",
    "title": "Full Stack Developer",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/70cd5f54-5c16-4d0c-a9dc-1f985bab6de2"
  },
  {
    "company": "Chess.com",

    "company_logo": null,
    "company_url": "https://www.chess.com",
    "created_at": "Fri Feb 19 01:05:59 UTC 2021",
    "description": "Chess.com is looking to add more senior backend PHP developers to help develop our Symfony-based chess platform. If you are a senior-level PHP rockstar/ninja/guru/kingpin/sherpa/wizard/pirate/_____ who wants to help an Alexa top 200 website become even more awesome, you are in the right place. You’ll work with an awesome team of frontend and backend developers to build new features, improve the platform, keep chess games going, and generally help make Chess.com the best possible experience for our members. \r\n\r\nSKILLS YOU NEED:\r\n\r\n- Testing\r\n- Caching\r\n- Debugging\r\n- Remote collaboration\r\n\r\nOUR TECH:\r\n- Symfony\r\n- MySQL\r\n- Git & GitHub\r\n- Doctrine\r\n- Redis\r\n- PHPUnit/PHPSpec\r\n- Resque\r\n- Development VMs: Vagrant/VirtualBox\r\n\r\nTYPES OF PROJECTS:\r\n- Build callbacks and APIs to support new features\r\n- Creative engineering tasks to support our team and users\r\n- Optimize performance\r\n\r\nOPPORTUNITY:\r\n- This is a full-time or equivalent position\r\n- This is a remote position (work from anywhere!)\r\n- Chess knowledge is NOT required; we're looking for passion and talent\r\n\r\nYou can learn more about us here:\r\n- https://www.chess.com/blog/erik/how-chess-com-s-100-person-virtual-team-works-together\r\n- https://www.chess.com/about",
    "how_to_apply": "Apply here: https://chesscom.rippling-ats.com/job/226413/php-symfony-developer",
    "id": "915c4df7-d378-4e69-9f94-1bd4e70eae38",
    "location": "Remote",
    "timestamp": "Mon Feb 22 2021 23:44:08 GMT+0100 (West Africa Standard Time)",
    "title": "Senior PHP / Symfony Developer at Chess.com",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/915c4df7-d378-4e69-9f94-1bd4e70eae38"
  },
  {
    "company": "FTL Labs Corp",
    "company_logo": null,
    "company_url": null,
    "created_at": "Thu Mar 11 14:18:48 UTC 2021",
    "description": "ABOUT THE POSITION:\r\n\r\nFTL Labs Corporation is seeking a full-time Engineering Software Developer with technical software development skills for desktop and Android platforms to address specific challenges relative to a contract program with the US Navy. Relevant skills include the following:\r\n\r\nC#, WPF, C++, SQL, Python\r\nMachine vision, image processing, and target recognition\r\n3D graphics, modeling, transforms, and visualization\r\nMathematical modelling and algorithms (MATLAB, R)\r\nMachine learning, neural nets, AI\r\nDatabase and cloud architectures\r\nVisualization and manipulation of large data sets\r\nPhotogrammetry, point clouds, and digitization of physical environments\r\nSelf-motivated and goal oriented\r\nFun and easy to work with in a dynamic team\r\n\r\nBachelor's degree or its equivalent with a minimum of 5 years of experience. Due to the nature of our work for the U.S. Government, we are required to hire U.S. Citizens. This position will work on an exciting 12 to 18-month program with the US Navy that employs cutting-edge image acquisition, 3D modeling, and artificial intelligence to solve maintenance and readiness challenges. Remote work is an option.\r\n\r\n$62,000 to $95,000 Annually\r\n401K, Dental, Life, Medical\r\nFull-Time\r\n\r\nFTL Labs continues to work from home primarily during COVID restrictions and could be acceptable generally. \r\n\r\nFTL Labs is in the vibrant intellectual community of western Massachusetts, close to the University of Massachusetts flagship campus and Amherst College. Pay is commensurate with experience. We offer competitive compensation and benefits, including excellent health and dental coverage, short- and long-term disability, life insurance, profit-sharing, and 401k with employer contribution. During the COVID public health emergency all FTL employees are telecommuting, and we look forward to returning to our office in Amherst when we can ensure it will not endanger the health or safety of our staff.\r\n\r\nAPPLICATION INSTRUCTIONS:\r\n\r\nPlease email your resume and 3 references (at least 2 professional contacts) to kristie@ftllabscorp.com and mike@ftllabscorp.com.\r\n\r\nABOUT FTL LABS:\r\n\r\nFTL Labs Corporation is a tight-knit association of Ph.D. scientists and seasoned engineers who work to develop next-generation software and technology products to solve problems for government and industrial clients. FTL personnel have participated in Phase I, Phase II, and Phase III Small Business Innovation Research (SBIR) programs through the National Science Foundation, Department of Defense, and NASA, and we strive to transition these technologies to the market. We frequently collaborate with both academic and industry leaders, such as UMass Amherst, Northrop Grumman and Sikorsky. Our work demonstrates innovative thinking in a team setting across a wide range of fields and specialties,  including:\r\n\r\n* Machine learning, neural nets, and artificial intelligence\r\n* Expertise in optics, ultrasound, image analysis, robotics, and life sciences\r\n* Big data analysis, virtual and augmented reality\r\n* Custom software solutions\r\n\r\nFTL Labs is an affirmative action-equal opportunity employer; veterans are encouraged to apply.\r\n\r\nWe comply with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state, or local laws.\r\n\r\nIf you are a creative self-starter, technically innovative, and have excellent writing skills, we want to hear from you!",
    "how_to_apply": "Please email your resume and 3 references (at least 2 professional contacts) to kristie@ftllabscorp.com and mike@ftllabscorp.com.",
    "id": "9eab3335-79db-4524-b91c-a65fb48916e5",
    "location": "Amherst MA - Remote",
    "timestamp": "Thu Mar 11 2021 15:38:01 GMT+0100 (West Africa Standard Time)",
    "title": "Engineering Software Developer",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/9eab3335-79db-4524-b91c-a65fb48916e5"
  },
  {
    "company": "Premiere Digital",
    "company_logo": null,
    "company_url": null,
    "created_at": "Fri Feb 19 15:38:29 UTC 2021",
    "description": "At Premiere, we are working with a large dataset to build software solutions for order tracking, global pricing management, targeted marketing, and sales analytics. \r\n\r\nWe’re looking for a web developer experienced with Python and interested in learning new technologies to join our team. You’ll work with our remote team to build great products that delight the people using them. \r\n\r\n### Who you are...\r\n* You’re a critical thinker. You’re able to be highly effective with very few directions. \r\n* You have excellent communication skills and the ability to convey your ideas clearly and concisely.\r\n* You are super smart and have either a degree in Computer Science or equivalent work experience.\r\n* You have the space, equipment, bandwidth, and personal commitment required to be highly productive while working from home.\r\n\r\n### You’re great at... \r\n* Collaborating with engineers and product managers to build web app components \r\n* Applying appropriate software design patterns for a given problem \r\n* Reading and understanding code whether you or someone else wrote it \r\n* Delivering quality code using Python for backend applications (Flask/Django) \r\n* Working with both relational and NoSQL databases (MySQL/Postgres/Cassandra/Elasticsearch/Redis) \r\n* JavaScript and UI development (jQuery/Bootstrap)\r\n* Maintaining automated tests and ensuring quality in your code \r\n* Using Git to manage multiple branches and fix merge conflicts \r\n\r\nBonus points if you have open source contributions or personal projects you’ve shipped successfully.",
    "how_to_apply": "Please send resume and cover letter to reid@premieredigital.net",
    "id": "abb3678a-3cb0-4b52-af21-0340ebdc6f2c",
    "location": "Remote",
    "timestamp": "Sun Feb 21 2021 08:28:20 GMT+0100 (West Africa Standard Time)",
    "title": "Python Web Developer",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/abb3678a-3cb0-4b52-af21-0340ebdc6f2c"
  },
  {
    "company": "Left GmbH",

    "company_logo": null,
    "company_url": "https://www.enote.com/",
    "created_at": "Thu Feb 18 10:02:01 UTC 2021",
    "description": "Our agile and cross-functional **Forge of Empires** team is searching for a **Frontend Developer**:\r\n\r\nAs a Frontend Developer, you will join a feature team of the Forge of Empires project to support growth, technical stability and longevity of our game.\r\n\r\nAre you a talented Game Developer and passionate about online games? Live your passion for online games/Game Development and collaborate with like-minded people to provide the best user experience for our players!\r\n\r\n**Your mission:**\r\n\r\n- Contribute to the continuous development and improvement of one of our keystone games\r\n- Develop new features and improve existing game features with a strong focus on UI and UX\r\n- Participate in the whole feature development lifecycle with a commitment to high-quality results\r\n- Collaborate closely with Mobile- & Backend Developers, Game Designers, and Artists to implement new game features for our browser clients\r\n\r\n**Your skillset:**\r\n\r\n- Working experience in Frontend/Game Development with Haxe. ActionScript 3 or JavaScript experience is a bonus.\r\n- A right eye for details and a passion for implementing UI and UX\r\n- Well-versed in design patterns and software architecture\r\n- Experience with writing browser automation tests\r\n- Solution-oriented and efficient style of work\r\n- Team player and a good communicator with fluent English language skills\r\n\r\n*Favorable*\r\n\r\n- Passion for online games (strategy/F2P) and knowledge of relevant game mechanics\r\n- Professional experience in the gaming industry, ideally working on comparable browser games\r\n- Theoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies\r\n- Know your way around popular scripting languages (Python / Bash / Groovy)\r\n- A proactive and motivated individual with a willingness to learn\r\n\r\n**Your power-ups:**\r\n\r\n- Get competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more\r\n- De-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more\r\n- Participate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting\r\n- Make the most of our excellent training and development opportunities\r\n- Feel comfortable in an atmosphere to empower creative thinking and strong results\r\n- Work in an agile multicultural team – enabling you and your team to form and actively optimize work processes\r\n- Our company language is English, and we support all our employees and their partners with optional German lessons\r\n- Receive exceptional support with your relocation to Hamburg\r\n- Shape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer\r\n\r\n**Our story:**\r\n\r\nInnoGames is Germany's leading developer and publisher of mobile and online games.\r\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.\r\n\r\nBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\r\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\r\n\r\nExcited to start your journey with InnoGames and join our dynamic team as a **Frontend Developer**?\r\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our [online application form](https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub). **Maximilian Kaeding** would be happy to answer any questions you may have.\r\n\r\n**Apply and #stayhome!**\r\nDue to the **coronavirus** outbreak, we switched our operations company-wide to home office and turned our hiring process into a **fully virtual one**.\r\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\r\nStay home and safe!\r\n",
    "how_to_apply": "[application form](https://t.gohiring.com/h/0e8dbabd408e777445446bf049cb8b58d5d4650be35da223dc6585e4afe3189b)",
    "id": "b1b4983c-9aba-4fa0-a6a2-8367be2ec30b",
    "location": "Berlin",
    "timestamp": "Sun Feb 21 2021 12:43:56 GMT+0100 (West Africa Standard Time)",
    "title": "NodeJS Service Developer (m/w/d)",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/b1b4983c-9aba-4fa0-a6a2-8367be2ec30b"
  },
  {
    "company": "InnoGames GmbH",
    "company_url": "https://www.innogames.com",
    "created_at": "Thu Feb 18 07:39:14 UTC 2021",
    "description": "Our agile and cross-functional **Forge of Empires** team is searching for a **Frontend Developer**:\r\n\r\nAs a Frontend Developer, you will join a feature team of the Forge of Empires project to support growth, technical stability and longevity of our game.\r\n\r\nAre you a talented Game Developer and passionate about online games? Live your passion for online games/Game Development and collaborate with like-minded people to provide the best user experience for our players!\r\n\r\n**Your mission:**\r\n\r\n- Contribute to the continuous development and improvement of one of our keystone games\r\n- Develop new features and improve existing game features with a strong focus on UI and UX\r\n- Participate in the whole feature development lifecycle with a commitment to high-quality results\r\n- Collaborate closely with Mobile- & Backend Developers, Game Designers, and Artists to implement new game features for our browser clients\r\n\r\n**Your skillset:**\r\n\r\n- Working experience in Frontend/Game Development with Haxe. ActionScript 3 or JavaScript experience is a bonus.\r\n- A right eye for details and a passion for implementing UI and UX\r\n- Well-versed in design patterns and software architecture\r\n- Experience with writing browser automation tests\r\n- Solution-oriented and efficient style of work\r\n- Team player and a good communicator with fluent English language skills\r\n\r\n*Favorable*\r\n\r\n- Passion for online games (strategy/F2P) and knowledge of relevant game mechanics\r\n- Professional experience in the gaming industry, ideally working on comparable browser games\r\n- Theoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies\r\n- Know your way around popular scripting languages (Python / Bash / Groovy)\r\n- A proactive and motivated individual with a willingness to learn\r\n\r\n**Your power-ups:**\r\n\r\n- Get competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more\r\n- De-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more\r\n- Participate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting\r\n- Make the most of our excellent training and development opportunities\r\n- Feel comfortable in an atmosphere to empower creative thinking and strong results\r\n- Work in an agile multicultural team – enabling you and your team to form and actively optimize work processes\r\n- Our company language is English, and we support all our employees and their partners with optional German lessons\r\n- Receive exceptional support with your relocation to Hamburg\r\n- Shape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer\r\n\r\n**Our story:**\r\n\r\nInnoGames is Germany's leading developer and publisher of mobile and online games.\r\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.\r\n\r\nBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\r\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\r\n\r\nExcited to start your journey with InnoGames and join our dynamic team as a **Frontend Developer**?\r\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our [online application form](https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub). **Maximilian Kaeding** would be happy to answer any questions you may have.\r\n\r\n**Apply and #stayhome!**\r\nDue to the **coronavirus** outbreak, we switched our operations company-wide to home office and turned our hiring process into a **fully virtual one**.\r\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\r\nStay home and safe!\r\n",
    "how_to_apply": "https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub",
    "id": "274a58c3-1f2e-4c24-a8d8-8dd2e41301b1",
    "location": "Hamburg",
    "timestamp": "Tue Feb 23 2021 13:09:14 GMT+0100 (West Africa Standard Time)",
    "title": "Frontend Developer (Haxe) - Video Game: Forge of Empires",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/274a58c3-1f2e-4c24-a8d8-8dd2e41301b1"
  },
  {
    "company": "Evernest GmbH",
    "company_logo": "",
    "company_url": null,
    "created_at": "Fri Feb 19 15:22:43 UTC 2021",
    "description": "Evernest is a Proptech startup from Hamburg backed by top investors. We are redefining how homes are bought and sold in metropolitan areas. To do so, we combine start-up culture with years of extensive industry experience. We are convinced that agents, sellers and buyers deserve a better service and more support. That is why we are bringing together the world’s top minds in technology, data and real estate. We offer agents and their clients a platform for a previously unseen and seamless real estate experience. \r\n\r\n\r\n**Responsibilities**\r\n- Building a top-notch and intuitive front-end for our platform that empowers real estate agents, buyers and sellers\r\n- Building a mobile application that empowers real estate agents\r\n- Evaluating visual designs from a technical perspective\r\n- Being part of our agile, smart and open-minded team\r\n- Getting better every day by taking on challenging tasks\r\n \r\n\r\n**Qualifications**\r\n- Solid understanding of and experience with React.js (> 3 years)\r\n- Profound knowledge of TypeScript/ESnext and its ecosystem (> 3 years), ideally also of other programming languages\r\n- Experience with CSS-in-JS technologies (preferred Emotion.js or Styled Components)\r\n- Understanding the importance of A11y and how to implement it in custom components\r\n- Mobile first layouts and responsive websites\r\n- Solid understanding of and experience with React Native\r\n- Semantic HTML and the value of SEO\r\n- DevOps mindset: operating and maintaining our software is a collective responsibility\r\n- Passion to share knowledge and strive to learn from others\r\n- Constant drive for improving processes and thinking in long-term wins\r\n- Good communication skills \r\n- Fluency in English, written and verbal; German is a plus\r\n\r\n**Current Tech Stack**\r\n- Docker, GCloud, Kubernetes\r\n- PostgreSQL\r\n- Python, Django, Django REST Framework\r\n- ES6, React, Typescript, Node.js\r\n- Contentful CMS\r\n- Storybook\r\n- Emotion.js\r\n- Next.js\r\n- GraphQL\r\n \r\n\r\n**Benefits**\r\n- Permanent position with above average compensation package\r\n- 27 days of paid vacation\r\n- Productivity equipment (laptop, mobile phone)\r\n- Homeoffice\r\n- Challenging position in a fast-paced environment\r\n \r\n\r\nYour mindset is what matters to us - your age, your sex or your origin makes no difference \r\nat Evernest. It’s important that you fit into our team.\r\n\r\n\r\nSounds good? Just submit your resume!\r\ntalents@evernest.com",
    "how_to_apply": "\r\nSounds good? Just submit your resume!\r\ntalents@evernest.com",
    "id": "5d42ea59-b94f-42bb-ba8f-e0418f714550",
    "location": "Hamburg",
    "timestamp": "Mon Feb 22 2021 18:00:41 GMT+0100 (West Africa Standard Time)",
    "title": "Senior Frontend Engineer*",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/5d42ea59-b94f-42bb-ba8f-e0418f714550"
  },
  {
    "company": "Lely",
    "company_logo": "https://upload.wikimedia.org/wikipedia/en/d/d7/Lely_new_logo.png",
    "company_url": "https://vonq.io/3bjlLpc",
    "created_at": "Mon Feb 22 16:19:18 UTC 2021",
    "description": "Beschrijving van het bedrijf\r\n-\r\n\r\nEen duurzame, winstgevende en aangename toekomst voor een melkveehouder door robotisering, engineering en boerenkennis te combineren, daar geloven we in. \r\n\r\nDat begon 70 jaar geleden met een droom van twee broers in Maassluis, sindsdien zijn we innovatieve koploper in geautomatiseerde systemen voor melkveehouders over de hele wereld. Met 1.600 gespecialiseerde professionals werken we constant aan nieuwe agrarische revoluties. Dat doen we nog steeds vanuit onze Campus in Maasluis, het gebouw met de hoogst haalbare duurzaamheidsprestaties van Nederland, maar ook wereldwijd. Met als doel, melkveehouden voor een volgende generatie (ook) interessant te maken.\r\n\r\nFunctieomschrijving\r\n-\r\n\r\nBinnen Lely zijn we bezig met de uitrol van de Office 365 suite. Dit betekent dat je mede verantwoordelijk bent voor de opzet, uitrol en adoptie van Office 365 binnen de Lely organisatie. We zijn daarom op zoek naar een IT Administrator O365 (Medior) voor de beheer en inrichting van de gehele Office 365/SharePoint omgeving. We werken al met de standaard Microsoft applicaties Word, Powerpoint, Excel, maar ook met Teams, Whiteboard, OneDrive, Flow en Exchange. Deze oplossingen willen we verder optimaliseren en uitbouwen. Hier krijg jij een spilrol in.\r\n\r\nJe komt in het IT Operations Team te werken. Dit team bestaat uit 25 andere IT collega’s die werken als Service Desk medewerker, IT Support medewerkers of IT Administrator. Het team is hecht, enthousiast en helpt elkaar graag om vooruit te komen. Jouw verantwoordelijkheden specifiek voor de Office 365 applicaties:\r\n- training geven over bijvoorbeeld nieuwe functionaliteiten of aan nieuwe gebruikers;\r\n- optimaal gebruik van Office 365 bevorderen binnen de Lely organisatie;\r\n- adviseren en onderzoeken naar nieuwe mogelijkheden van Office 365;\r\n- analyseren van wensen en behoeften van de interne klant en deze omzetten naar oplossingen;\r\nuitrol nieuwe functies en het beheer van de omgeving.\r\n\r\nFunctie-eisen\r\n-\r\n\r\nBinnen Lely krijg je de kans om jouw kennis verder uit te bouwen. De ideale kandidaat neemt het volgende mee:\r\n\r\n- hbo werk- en denk niveau;\r\n- minimaal 3 jaar werkervaring als IT Administrator O365\r\n- gecertificeerd als Microsoft Enterprise Administrator (MS100-MS101 en MS200-MS201);\r\n- eventueel ook gecertificeerd voor MS 365 Security Administration (MS-500) en MS Managing Microsoft Teams (MS-700);\r\n- kennis en ervaring in het documenteren;\r\n- communicatief sterk, je kunt alles uitleggen aan de gebruikers;\r\n- belangrijk voor deze positie is goede beheersing van de Nederlandse en Engelse taal in woord en geschrift;\r\n- (ervaring met het geven van O365 trainingen).\r\n\r\nVerder ben je in staat om mee te denken met de verdere inrichting van onze Office 365 omgeving en jouw kennis ook intern over te dragen. Je bent toegankelijk en gemakkelijk aan te spreken en kunt met geduld en enthousiasme nieuwe- en bestaande tools op de juiste manier uitleggen en beheren.\r\n\r\nExtra informatie\r\n-\r\n\r\nDoor onze innovatieve cultuur zijn wij steeds in beweging en dat betekent dat er enorm veel uitdagingen liggen binnen de IT Operations afdeling. Dit is jouw kans om een onderdeel te worden van dit ambitieuze en succesvolle team. Verder…\r\n\r\n- Je gaat aan de slag met een enthousiast en ambitieus team; \r\n- Werken in een internationale omgeving bij één van de meest innovatieve organisaties van Nederland; \r\n- Je komt te werken in het duurzaamste kantoor en productielocatie van Europa;\r\n- Vrijheid in het organiseren van je eigen werk; \r\n- Een goed salaris die past bij de uitdaging in relatie tot jouw kennis en ervaring; \r\n- Salarisschaal die loopt tot 4200,- waarbij wij graag zien dat je nog kan groeien;\r\n- 27 vakantiedagen en 13 roostervrije dagen;\r\n- de mogelijkheid om per jaar 6 roostervrije dagen te verkopen;\r\n- flexibiliteit in werktijden en werkplek;\r\n- tegemoetkoming in diverse verzekeringspremies;\r\n- Lely Academy met een aanbod van verschillende opleidingen die je zonder verplichtingen kunt volgen;\r\n- Bedrijfsrestaurant met een rijk en gezond aanbod;\r\n- Werken in een enthousiast en ambitieus team.\r\n\r\nOm antwoord te kunnen geven op de voedsel uitdaging voor 2050 is het van groot belang om verantwoord met mens, dier en milieu te blijven omgaan. Voor ons betekent het dat we een betrouwbare partner voor de lange termijn willen zijn voor onze klanten. En daarnaast willen we de wereld doorgeven aan de volgende generatie door het duurzaam ontwikkelen van onze producten. Jij kan een bijdrage leveren in het realiseren van deze droom. \r\n\r\nInteresse?\r\n-\r\n\r\nSolliciteer nu via het __sollicitatieformulier__.\r\n\r\nDaarnaast ook Familiebedrijf van het jaar 2019, Great Place to Work gecertificeerd en nog veel meer... \r\n\r\nWerving & selectiebureau, consultancy en/of detacheringsbureau? We stellen de interesse op prijs, maar we zoeken al onze kandidaten rechtstreeks. We begrijpen dat jullie als intermediair de kandidaten onze toffe posities willen voorleggen en zo bijdragen aan onze ambities, maar dit is niet hoe wij onze werving hebben ingericht. Dit betekent dat alle ongevraagde profielen die worden aangeboden op Lely vacatures, als directe sollicitaties zullen worden behandeld.\r\n\r\n[Klik hier voor het sollicitatieformulier!](https://vonq.io/3bjlLpc)",
    "how_to_apply": "[Klik hier voor het sollicitatieformulier!](https://vonq.io/3bjlLpc)\r\n",
    "id": "c5277613-6984-4ba5-aa4f-001d68cbd607",
    "location": "Maassluis",
    "timestamp": "Mon Feb 22 2021 12:14:42 GMT-0500 (Eastern Standard Time)",
    "title": "IT Administrator O365",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/c5277613-6984-4ba5-aa4f-001d68cbd607"
  },
  {
    "company": "Wallet.Services",
    "company_logo": "https://siccar.net/wp-content/uploads/2021/05/logo_by.png",
    "company_url": "https://siccar.net/",
    "created_at": "Tue Feb 23 09:37:10 UTC 2021",
    "description": "**Front End Developer (HTML/CSS/JS)**  \r\n\r\n**About Us**  \r\n\r\nSICCAR aims to connect and protect business and society. SICCAR enables organisations to share sensitive data through one trustworthy digital platform. Our platform addresses data sharing problems during interactions between citizens and government bodies.  \r\n\r\nSICCAR adopts distributed ledger technology (DLT), to deliver a cyber secure platform for organisations to collaborate on secure reliable data. SICCAR facilitates secure data sharing where data security, protection, integrity and governance are required.  \r\n\r\n**About the Job**  \r\n\r\nWe're looking for an enthusiastic and keen Front End Developer to join us and help make the digital world safer and more efficient with software that provides streamlined and secure digital process.  \r\n\r\nThe post is a key member of the development team who will:\r\n\r\n*   work closely with our in-house UI/UX designer and implement their design into front end apps;\r\n*   take the existing front end resources and own them with a view of open sourcing them;\r\n*   liase with customers and clients to understand their needs;\r\n*   be data driven when it comes to the apps and their development.\r\n\r\n**About You**  \r\n\r\nSuitable candidates with approximately 3 years of the following experience:\r\n\r\n*   HTML 5, CSS with a demonstrable portfolio.\r\n*   Any client-side JavaScript technologies such as web components (Angular, React, VueJS etc.).\r\n*   JSON, RESTful APIs.\r\n*   Front end testing frameworks (Jasmine/Mocha).\r\n*   Knowledge and experience of applying engineering principles and practices for design, build, test and deployment.\r\n*   Experience with DevOps and continuous integration.\r\n*   Committed to high quality, clean code.\r\n*   Excellent communication skills with the ability to build effective working relationships with stakeholders at all levels.\r\n*   Solid understanding of design principles, a creative mind and an eye for detail.\r\n\r\nIt would be great if you could provide a portfolio where you can show:\r\n\r\n*   Examples of where you have implemented someone elses design.\r\n*   Examples of where you have worked on your own but also as part of a team.\r\n*   Examples of where you have implemented data driven analytics and made appropriate changes.\r\n\r\n**Salary and Benefits:**\r\n\r\n*   Remote working with full flexibility.\r\n*   A competitive salary that reflects your experience and merit.\r\n*   Pension contributions.\r\n*   A discretionary equity-based incentive plan.\r\n*   An employee referral program.\r\n*   Cyclescheme, Techscheme.\r\n\r\n**Are you up for the challenge?**  \r\n\r\nApply now via the [**application form**](https://ltpx.nl/goVKRPS).  \r\n\r\n_Agency calls are not appreciated._![](https://t.ltpx.nl/track.php?orderid=235816)",
    "how_to_apply": "[Click here to apply](https://ltpx.nl/WHSCsYD)",
    "id": "ef15da6b-5d13-4c2b-942a-ec3ea02b608e",
    "location": "Edinburgh",
    "timestamp": "Wed Feb 24 2021 11:53:26 GMT+0100 (West Africa Standard Time)",
    "title": "Front End Developer (HTML/CSS/JS)",
    "type": "Full Time",
    "uid": "LWPqNfL8yqMshLppoowyKJ9uEt02",
    "url": "https://jobs.github.com/positions/ef15da6b-5d13-4c2b-942a-ec3ea02b608e"
  }
]
